'''
Задача 5
Вывести цифры числа на каждой строчке.
'''

integer_number = input("Пожалуйста, введите число: ")

for i in range(len(integer_number)):
    print(integer_number[i])
